Задание 1
Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со
столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и
['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно
содержатся данные:
[1, 1, 1, 2, 2, 3, 3],
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и
поклонники']
Нужны prices!
[500, 400, 300, 350, 450, 600, 200]

In [1]:
import pandas as pd

In [6]:
authors_data = {'author_id': [1, 2, 3], 
                       'author_name': ['Тургенев', 'Чехов', 'Островский']}
authors_data

{'author_id': [1, 2, 3], 'author_name': ['Тургенев', 'Чехов', 'Островский']}

In [7]:
authors = pd.DataFrame(authors_data)
authors.head()

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [9]:
book_data = {'author_id': [1, 1, 1, 2, 2, 3, 3],
            'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
            'price': [500, 400, 300, 350, 450, 600, 200]}
book_data

{'author_id': [1, 1, 1, 2, 2, 3, 3],
 'book_title': ['Отцы и дети',
  'Рудин',
  'Дворянское гнездо',
  'Толстый и тонкий',
  'Дама с собачкой',
  'Гроза',
  'Таланты и поклонники'],
 'price': [500, 400, 300, 350, 450, 600, 200]}

In [10]:
book = pd.DataFrame(book_data)
book.head()

   author_id         book_title  price
0          1        Отцы и дети    500
1          1              Рудин    400
2          1  Дворянское гнездо    300
3          2   Толстый и тонкий    350
4          2    Дама с собачкой    450

Задание 2
Получите датафрейм authors_price, соединив дата фреймы authors и books по полю author_id.

In [11]:
authors_price = pd.merge(authors, book, on='author_id')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    500
1          1    Тургенев                 Рудин    400
2          1    Тургенев     Дворянское гнездо    300
3          2       Чехов      Толстый и тонкий    350
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    600
6          3  Островский  Таланты и поклонники    200

Задание 3
Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими
книгами.

In [14]:
top5 = authors_price.nlargest(5,'price')
top5

   author_id author_name        book_title  price
5          3  Островский             Гроза    600
0          1    Тургенев       Отцы и дети    500
4          2       Чехов   Дама с собачкой    450
1          1    Тургенев             Рудин    400
3          2       Чехов  Толстый и тонкий    350

Задание 4
Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat
должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя
цена на книги этого автора.

In [16]:
grouped_by_author = authors_price.groupby('author_name')
grouped_by_author.head()

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    500
1          1    Тургенев                 Рудин    400
2          1    Тургенев     Дворянское гнездо    300
3          2       Чехов      Толстый и тонкий    350
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    600
6          3  Островский  Таланты и поклонники    200

In [19]:
min_price = grouped_by_author['price'].min()
max_price = grouped_by_author['price'].max()
mean_price = grouped_by_author['price'].mean()

In [21]:
authors_stat = pd.DataFrame({
    'min_price': min_price,
    'max_price': max_price,
    'mean_price': mean_price
}).reset_index()
authors_stat

  author_name  min_price  max_price  mean_price
0  Островский        200        600       400.0
1    Тургенев        300        500       400.0
2       Чехов        350        450       400.0

Задание 5**
Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться
данные о том, какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные
из следующего списка:
['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].
Просмотрите документацию по функции pd.pivot table с помощью вопросительного знака.
Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. Используйте
для этого функцию pd.pivot_table. При этом столбцы должны называться "твердая" и "мягкая", а
индексами должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями,
при необходимости загрузите библиотеку Numpy.
Назовите полученный датасет book_info и сохраните его в формат pickle под названием
"book_info.pkl". Затем загрузите из этого файла датафрейм и назовите его book_info2. Удостоверьтесь,
что датафреймы book_info и book_info2 идентичны.

In [22]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']

In [24]:
pd.pivot_table?

In [26]:
import numpy as np

In [27]:
book_info = pd.pivot_table(authors_price, values='price', index='author_name', columns='cover', aggfunc=np.sum, fill_value=0)
book_info

cover        мягкая  твердая
author_name
Островский      800        0
Тургенев        700      500
Чехов             0      800

In [28]:
book_info.to_pickle("book_info.pkl")

In [30]:
book_info2 = pd.read_pickle("book_info.pkl")
book_info2

cover        мягкая  твердая
author_name
Островский      800        0
Тургенев        700      500
Чехов             0      800

In [31]:
book_info.equals(book_info2)

True